GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/InformationRegisters/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияВерсии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучениеВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПолучена</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияВыгружена</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаМетаданных</name>
  </enumValues>
  <enumValues>
    <name>МетаданныеЗагружены</name>
  </enumValues>
  <enumValues>
    <name>НачалоКоммита</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПомещена</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееСостояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Состояние");
	
	Если Состояние <> ПредыдущееСостояние Тогда
		
		ДополнительныеСвойства.Вставить("ЗаписыватьНовоеСостояние", Истина);
		
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияВерсии.ПолучениеВерсии 
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОчередиВыполнения")
		ИЛИ НЕ ЗначениеЗаполнено(Источник) Тогда
		Источник = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗаписыватьНовоеСостояние") Тогда
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		НаборЗаписей = РегистрыСведений.СостоянияВерсии.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияХранилища.Установить(Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДатаСеанса;
		Запись.ВерсияХранилища = Ссылка;
		Запись.Состояние = Состояние;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияВерсии.ВерсияПомещена
		И (ЗначениеЗаполнено(КаталогИБ) 
		ИЛИ ЗначениеЗаполнено(КаталогФайловКонфигурации)
		ИЛИ ЗначениеЗаполнено(КаталогВременныхФайлов))Тогда
		
		КонвертацияХранилища.УдалитьФайлыВерсииВФоне(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти

#КонецЕсли
